# TextLeading

## Description
Procedure TextLeading sets the default line spacing of VectorWorks to a custom leading value (in points).

```pascal
PROCEDURE TextLeading(leading : REAL);
```

```python
def vs.TextLeading(leading):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|leading|REAL|Custom leading value for document.|

## Version
Availability: from VectorWorks8.0

## Category
* Objects - Text